Revit 2026 API

# OpenOptions Class

---

This class contains options available for opening a document from disk.

SystemObject Autodesk.Revit.DBOpenOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class OpenOptions : IDisposable
```
```vb
Public Class OpenOptions
	Implements IDisposable
```
```cpp
public ref class OpenOptions : IDisposable
```
```fsharp
type OpenOptions =
    class
        interface IDisposable
    end
```

The OpenOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | OpenOptions | Constructs a new instance of the options class using default values. |

|  | Name | Description |
| --- | --- | --- |
|  | AllowOpeningLocalByWrongUser | Specifies whether a local file is allowed to be opened as read-only by a user other than its owner. |
|  | Audit | Specifies whether to expand all elements in order to check for corruption. |
|  | DetachFromCentralOption | An option that specifies whether or not a workset-enabled document is detached from its central document. |
|  | IgnoreExtensibleStorageSchemaConflict | Specifies whether to ignore the error of schema conflict. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | OpenForeignOption | An option that specifies how to open files saved by an application that was not developed or licensed by Autodesk. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the OpenOptions |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetOpenWorksetsConfiguration | Gets the object used to configure the worksets to open when the model is opened. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetOpenWorksetsConfiguration | Sets the object used to configure the worksets to open when the model is opened. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace